Tekla Open API Reference for Tekla Structures 2025
Drawing.Layout Property
 Gets the drawing layout attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LayoutAttributes Layout { get; }
Public ReadOnly Property Layout As LayoutAttributes
	Get
Property Value
Type: LayoutAttributes
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace